module.exports = {
  BAD_REQUEST_USER_SEARCH: 'Запрашиваемый пользователь не найден',
  BAD_REQUEST_USER_CREATE: 'Переданы некорректные данные при создании пользователя',
  BAD_REQUEST_USER_UPD: 'Переданы некорректные данные при обновлении профиля',
  BAD_REQUEST_AVATAR_UPD: 'Переданы некорректные данные при обновлении аватара',
  BAD_REQUEST_CARD: 'Переданы некорректные данные',
  NOT_FOUND: 'Пользователь по указанному _id не найден',
  NOT_FOUND_CARD: 'Карточка с указанным _id не найдена',
  INTERNAL_SERVER: 'Произошла ошибка на сервере',
};
